app/controllers/effects_controller.rb

  def index
    @effects = Effect.order("updated_at DESC")
---
SELECT "effects".* FROM "effects" ORDER BY updated_at DESC

  def show
    @effect = Effect.find(params[:id])
---
SELECT "effects".* FROM "effects" WHERE "effects"."id" = ? LIMIT 1  [["id", "1"]]

  def download
      @effect = Effect.find(params[:id])
---
SELECT "effects".* FROM "effects" WHERE "effects"."id" = ? LIMIT 1  [["id", "6"]]

  def edit
    @effect = Effect.find(params[:id])
---
SELECT "effects".* FROM "effects" WHERE "effects"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @effect = Effect.new(params[:effect])

		@effect.user=current_user

    respond_to do |format|
      if @effect.save
---
INSERT INTO "effects" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "a fondus"], ["created_at", Thu, 26 Dec 2013 04:59:04 UTC +00:00], ["title", "terrible sound"], ["updated_at", Thu, 26 Dec 2013 04:59:04 UTC +00:00], ["user_id", nil]]