app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"