app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks" ORDER BY updated_at_DESC
---
  def index
    @tracks = Track.order("updated_at DESC")

INSERT INTO "tracks" ("autor", "created_at", "genre_id", "title", "tracks", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @track = Track.new(params[:track])
	@track.user = current_user
	@track.genre_id = params[:genre]

    respond_to do |format|
      if @track.save